---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.SymbolicCurve
source: html/a503b4e2-9381-1b94-e37b-2bc3b6783de1.htm
---
# SymbolicCurve Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.